DataProcessors/Renault_АРМСотрудникаСлужбыСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_АРМСотрудникаСлужбыСтрахования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПодбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Renault_БСОВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_БСОВОрганизации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Renault_СтатусыБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СтатусыБСО</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыБСО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Renault_СтраховыеПолисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_СтраховыеПолисы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраховаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраховаяПремия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВидыФинансовыхУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Renault_КвитанцииКПолисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КвитанцииКПолисам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтраховойПолис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Renault_БСОНаТочкеПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_БСОНаТочкеПродаж</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/Renault_СтатусыБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СтатусыБСО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятИзСК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданНаТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чистый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_АРМСотрудникаСлужбыСтрахования/Ext/ObjectModule.bsl
Функция ПолучитьБСОВОрганизации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_БСОВОрганизацииОстатки.ТипБСО,
	               |	Renault_БСОВОрганизацииОстатки.СерияБСО,
	               |	Renault_БСОВОрганизацииОстатки.НомерБСО,
	               |	Renault_БСОВОрганизацииОстатки.СтраховаяКомпания,
	               |	ВЫБОР
	               |		КОГДА Renault_СтатусыБСОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.ПринятИзСК)
	               |				ИЛИ Renault_СтатусыБСОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.ПереданНаТочку)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.Чистый)
	               |		ИНАЧЕ Renault_СтатусыБСОСрезПоследних.Статус
	               |	КОНЕЦ КАК Статус,
	               |	Renault_СтатусыБСОСрезПоследних.Период,
	               |	ВЫБОР
	               |		КОГДА НЕ Renault_СтраховыеПолисы.СтраховаяКомпания ЕСТЬ NULL 
	               |				ИЛИ НЕ Renault_КвитанцииКПолисам.СтраховаяКомпания ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Использован
	               |ИЗ
	               |	РегистрНакопления.Renault_БСОВОрганизации.Остатки(, Организация = &Организация) КАК Renault_БСОВОрганизацииОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СтатусыБСО.СрезПоследних(, Организация = &Организация) КАК Renault_СтатусыБСОСрезПоследних
	               |		ПО Renault_БСОВОрганизацииОстатки.Организация = Renault_СтатусыБСОСрезПоследних.Организация
	               |			И Renault_БСОВОрганизацииОстатки.СтраховаяКомпания = Renault_СтатусыБСОСрезПоследних.СтраховаяКомпания
	               |			И Renault_БСОВОрганизацииОстатки.ТипБСО = Renault_СтатусыБСОСрезПоследних.ТипБСО
	               |			И Renault_БСОВОрганизацииОстатки.СерияБСО = Renault_СтатусыБСОСрезПоследних.СерияБСО
	               |			И Renault_БСОВОрганизацииОстатки.НомерБСО = Renault_СтатусыБСОСрезПоследних.НомерБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_СтраховыеПолисы КАК Renault_СтраховыеПолисы
	               |		ПО Renault_БСОВОрганизацииОстатки.Организация = Renault_СтраховыеПолисы.Организация
	               |			И Renault_БСОВОрганизацииОстатки.СерияБСО = Renault_СтраховыеПолисы.СерияБСО
	               |			И Renault_БСОВОрганизацииОстатки.НомерБСО = Renault_СтраховыеПолисы.НомерБСО
	               |			И Renault_БСОВОрганизацииОстатки.СтраховаяКомпания = Renault_СтраховыеПолисы.СтраховаяКомпания
	               |			И Renault_БСОВОрганизацииОстатки.ТипБСО = Renault_СтраховыеПолисы.ТипБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КвитанцииКПолисам КАК Renault_КвитанцииКПолисам
	               |		ПО Renault_БСОВОрганизацииОстатки.СтраховаяКомпания = Renault_КвитанцииКПолисам.СтраховаяКомпания
	               |			И Renault_БСОВОрганизацииОстатки.ТипБСО = Renault_КвитанцииКПолисам.ТипБСО
	               |			И Renault_БСОВОрганизацииОстатки.СерияБСО = Renault_КвитанцииКПолисам.СерияБСО
	               |			И Renault_БСОВОрганизацииОстатки.НомерБСО = Renault_КвитанцииКПолисам.НомерБСО";
				   
	Возврат Запрос.Выполнить().Выгрузить();			   
	
КонецФункции

Процедура ЗаполнитьДокумент(ДокументОбъект, МассивСтрок) Экспорт
	
	ДокументОбъект.ТочкаПродаж = ТочкаПродаж;
	ДокументОбъект.Организация = Организация;
	
	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока = ДокументОбъект.БСО.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.НомерБСОНач = Строка.НомерБСО;
		НоваяСтрока.Количество = 1;
	КонецЦикла;	
	
КонецПроцедуры	

Функция ПолучитьБСОНаТочке() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТочкаПродаж", ТочкаПродаж);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_БСОНаТочкеПродажОстатки.ТипБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.СерияБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.НомерБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания,
	               |	ВЫБОР
	               |		КОГДА Renault_СтатусыБСОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.ПринятИзСК)
	               |				ИЛИ Renault_СтатусыБСОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.ПереданНаТочку)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.Renault_СтатусыБСО.Чистый)
	               |		ИНАЧЕ Renault_СтатусыБСОСрезПоследних.Статус
	               |	КОНЕЦ КАК Статус,
	               |	Renault_СтатусыБСОСрезПоследних.Период,
	               |	ВЫБОР
	               |		КОГДА НЕ Renault_СтраховыеПолисы.СтраховаяКомпания ЕСТЬ NULL 
	               |				ИЛИ НЕ Renault_КвитанцииКПолисам.СтраховаяКомпания ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Использован
	               |ИЗ
	               |	РегистрНакопления.Renault_БСОНаТочкеПродаж.Остатки(
	               |			,
	               |			Организация = &Организация
	               |				И ТочкаПродаж = &ТочкаПродаж) КАК Renault_БСОНаТочкеПродажОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СтатусыБСО.СрезПоследних(, Организация = &Организация) КАК Renault_СтатусыБСОСрезПоследних
	               |		ПО Renault_БСОНаТочкеПродажОстатки.Организация = Renault_СтатусыБСОСрезПоследних.Организация
	               |			И Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания = Renault_СтатусыБСОСрезПоследних.СтраховаяКомпания
	               |			И Renault_БСОНаТочкеПродажОстатки.ТипБСО = Renault_СтатусыБСОСрезПоследних.ТипБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.СерияБСО = Renault_СтатусыБСОСрезПоследних.СерияБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.НомерБСО = Renault_СтатусыБСОСрезПоследних.НомерБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_СтраховыеПолисы КАК Renault_СтраховыеПолисы
	               |		ПО Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания = Renault_СтраховыеПолисы.СтраховаяКомпания
	               |			И Renault_БСОНаТочкеПродажОстатки.ТипБСО = Renault_СтраховыеПолисы.ТипБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.СерияБСО = Renault_СтраховыеПолисы.СерияБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.НомерБСО = Renault_СтраховыеПолисы.НомерБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КвитанцииКПолисам КАК Renault_КвитанцииКПолисам
	               |		ПО Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания = Renault_КвитанцииКПолисам.СтраховаяКомпания
	               |			И Renault_БСОНаТочкеПродажОстатки.ТипБСО = Renault_КвитанцииКПолисам.ТипБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.СерияБСО = Renault_КвитанцииКПолисам.СерияБСО
	               |			И Renault_БСОНаТочкеПродажОстатки.НомерБСО = Renault_КвитанцииКПолисам.НомерБСО";
				   
	Возврат Запрос.Выполнить().Выгрузить();			   
	
КонецФункции

Процедура ЗаполнитьСтраховойПолис(ДокументОбъект, ДанныеЗаполнения) Экспорт
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеЗаполнения);
	
КонецПроцедуры
